{% extends 'base.html' %}
{% block conteudo %}

<div class="container my-5">
    <h1>CURSO DE PHP 8 DO ZERO AO PROFISSIONAL</h1>
    
    <div class="texto">
                        <p><p><strong>O curso de PHP 8 do Zero ao Profissional </strong>foi desenvolvido para voc&ecirc; que quer Aprender PHP de uma maneira simples, r&aacute;pida e na pr&aacute;tica, sem dificuldades desde a logica de programa&ccedil;&atilde;o, o ambiente de desenvolvimento at&eacute; o desenvolvimento de projetos reais.</p><p>Neste curso, iremos passo a passo do zero, ou seja, desde a primeira linha de c&oacute;digo, sem utilizar nenhum recurso ou framework pronto, criar uma estrutura completa utilizando o padr&atilde;o de projetos MVC (Model View Controller) usando PHP Orientado a Objetos.</p><p><strong>Vamos desenvolver do zero um projeto real e auto escal&aacute;vel,</strong> ao final do curso voc&ecirc; ter&aacute; desenvolvimento um micro framework real que pode ser colocado em produ&ccedil;&atilde;o, ou seja, voc&ecirc; pode colocar online de forma segura, tanto para uso pessoal ou comercialmente de diferentes formas. Voc&ecirc; ver&aacute; v&aacute;rios exemplos reais do que ser&aacute; capaz de desenvolver.</p><p>Com o que voc&ecirc; aprender&aacute; nesse curso, no final, <strong>voc&ecirc; ser&aacute; capaz de criar seus pr&oacute;prios projetos</strong>, desde pequenos sites est&aacute;ticos, a projetos mais complexos e robustos como portais de not&iacute;cias, portais de prefeituras, lojas virtuais, sites de portfolios, sites sociais, dentre muitos outros tipos de sistemas web e ganhar dinheiro desenvolvendo sistemas profissionais de forma &aacute;gil e segura.</p><p>O projeto desenvolvido durante o curso &eacute; altamente escal&aacute;vel e de c&oacute;digo fonte aberto e voc&ecirc; pode utiliza-lo e altera-lo livremente como quiser e estar&aacute; dispon&iacute;vel para download.</p><p>Um dos maiores diferenciais do curso &eacute; que voc&ecirc; n&atilde;o ir&aacute; aprender teorias ou f&oacute;rmulas m&aacute;gicas, programa&ccedil;&atilde;o s&oacute; se aprende na pr&aacute;tica, a teoria fica para os livros, voc&ecirc; vai terminar esse curso de PHP entendendo os porqu&ecirc;s, a l&oacute;gica por tr&aacute;s de projetos reais, <strong>desde o ambiente de produ&ccedil;&atilde;o, o primeiro arquivo no seu computador at&eacute; o projeto online em uma hospedagem real</strong>, o que vai te tornar um profissional muito mais qualificado e competitivo no mercado, entregando solu&ccedil;&otilde;es, resolvendo problemas do mundo real.</p><p><strong>Neste curso voc&ecirc; vai aprender a criar solu&ccedil;&otilde;es e a resolver problemas reais</strong>, aprendera a resolver problemas a e criar solu&ccedil;&otilde;es de diferentes formas para aplicar no mundo real e para que n&atilde;o fique prezo em solu&ccedil;&otilde;es &uacute;nicas ou complexas de mais que s&oacute; te fazem perder tempo.</p><p><strong>Invista na sua carreira, invista em voc&ecirc;. A &aacute;rea de desenvolvimento web cresce mais e mais a cada dia, n&atilde;o fique de fora, comece j&aacute;.</strong></p><p><strong>Para quem &eacute; este curso:</strong></p><ul><li>Pessoas que desejam se tornar um desenvolvedor PHP profissional.</li><li>Pessoas que desejam aprender PHP Orientado a Objetos Avan&ccedil;ado e MVC (Model View Controller).</li><li>Pessoas que desejam aprender a usar o banco de dados MySQL.</li><li>Pessoas que desejam aprender a usar o phpMyAdmin como gerenciador de banco de dados.</li><li>Qualquer pessoa que desejar seguir a carreira de desenvolvedor Web de Forma Profissional.</li><li>Pessoas que Desejam Ganhar Dinheiro Desenvolvendo Sistemas Web Robustos, Reutiliz&aacute;veis e Auto Escal&aacute;veis.</li><li>Pessoas que desejam Desenvolver Projetos e Solu&ccedil;&otilde;es Reais para uso Pessoal ou Profissional.</li></ul><p><strong>Requisitos</strong></p><ul><li>No&ccedil;&otilde;es b&aacute;sicas de inform&aacute;tica, como salvar imagens, criar pastas, acessar links e sites da internet, salvar, copiar, colar e recortar.</li><li>Os pr&eacute;-requisitos n&atilde;o s&atilde;o obrigat&oacute;rios, mas eles d&atilde;o uma base de parte do conhecimento necess&aacute;rio que se precisa ter para fazer esse curso.</li></ul><p><strong>O que voc&ecirc; aprender&aacute;</strong></p><ul><li>Construir um Micro Framework MVC personalizado e auto escal&aacute;vel do Zero sem uso de qualquer tipo de Framework como Laravel, CodeIgniter, Zend etc...</li><li>Criar classe PDO personalizada para realizar intera&ccedil;&otilde;es com o Banco de Dados.</li><li>Utilizar o phpMyAdmin no gerenciamento de banco de dados MySQL.</li><li>Utilizar Composer que &eacute; o gerenciador de depend&ecirc;ncias do PHP.</li><li>Autentica&ccedil;&atilde;o segura de usu&aacute;rios com senhas hash usando OOP e PDO.</li><li>Criar Classes e Fun&ccedil;&otilde;es Auxiliares Reutiliz&aacute;veis.</li><li>Criar Classes Robustas e Auto Escal&aacute;vel, da Logica Estrutural a Abstra&ccedil;&atilde;o e o Desenvolvimento da Classe.</li><li>Implementar e Utilizar a Biblioteca CSS Bootstrap 5 para estilizar as Views.</li><li>Criar seus Pr&oacute;prios Projetos em PHP Orientado a Objetos Utilizando o Padr&atilde;o de Projetos MVC.</li><li>Compreender e Desenvolver navega&ccedil;&atilde;o utilizando rotas com URLs amig&aacute;veis.</li><li>Utilizar o Twig que &eacute; uma engine de templates PHP baseado no modelo MVC.</li><li>Escrever c&oacute;digos limpos, simples e de qualidade, seguindo boas pr&aacute;ticas de programa&ccedil;&atilde;o PSR - PHP Standards Recommendations.</li><li>Utilizar o Packagist que &eacute; um reposit&oacute;rio de Pacotes do PHP.</li><li>Utilizar bibliotecas robustas como PHPMailer, Twig e SimpleRouter.</li><li>Registrar um Dom&iacute;nio e Contratar uma Hospedagem Profissional.</li><li>Deploy - Configurar e Hospedar o Projeto Online em uma Hospedagem real.</li></ul></p>
                    </div>
    
</div>

{% endblock %}